init.org
#+TITLE: Cássio's Emacs Config
#+AUTHOR: Cássio Ávila
#+PROPERTY: header-args:emacs-lisp :tangle yes
#+STARTUP: content

* Performance

** Early init

#+begin_src emacs-lisp :tangle early-init.el
  ;; -*- lexical-binding: t; -*-

  ;; Garbage Collections
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)

  (add-hook 'emacs-startup-hook
            #'(lambda () (setq gc-cons-threshold (* 2 1000 1000))))

  ;; Compile warnings
  ;;  (setq warning-minimum-level :emergency)
  (setq native-comp-async-report-warnings-errors 'silent) ;; native-comp warning
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

  (setq package-native-compile t
        native-comp-deferred-compilation t
        native-comp-async-report-warnings-errors nil)

  ;; optimizations (froom Doom's core.el). See that file for descriptions.
  (setq idle-update-delay 1.0)

  ;; Disabling bidi (bidirectional editing stuff)
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t)  ; emacs 27 only - disables bidirectional parenthesis

  (setq highlight-nonselected-windows nil)
  (setq fast-but-imprecise-scrolling t)
  (setq inhibit-compacting-font-caches t)

  ;; Data emacs reads from process
  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  (setq package-enable-at-startup nil)
#+end_src

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s seconds with %d garbage collections."
                       (emacs-init-time "%.2f")
                       gcs-done)))
#+end_src

** Native Compilation

#+begin_src emacs-lisp
  ;; Silence compiler warnings as they can be pretty disruptive
  (setq native-comp-async-report-warnings-errors nil)

  ;; Set the right directory to store the native comp cache
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
#+end_src

* Variables
** Ignored buffers

#+begin_src emacs-lisp
  (defvar ignored-buffers '("\\*Messages\\*"
                            "\\*straight-process\\*"
                            "\\*Help\\*"
                            "\\*Backtrace\\*"))
#+end_src

* Custom macros

#+begin_src emacs-lisp
  (defmacro remove-from-list (list value)
    `(setq ,list (remove ,value ,list)))
#+end_src

* Package Management
** Straight

#+begin_src emacs-lisp
  (unless (featurep 'straight)
    ;; Bootstrap straight.el
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
          (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage)))

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src

** Setup.el

#+begin_src emacs-lisp
  (straight-use-package '(setup :type git :host nil :repo "https://git.sr.ht/~pkal/setup"))
  (require 'setup)

  (setup-define :disabled
    (lambda ()
      `,(setup-quit))
    :documentation "Always stop evaluating the body.")

  (setup-define :load-after
      (lambda (features &rest body)
        (let ((body `(progn
                       (require ',(setup-get 'feature))
                       ,@body)))
          (dolist (feature (if (listp features)
                               (nreverse features)
                             (list features)))
            (setq body `(with-eval-after-load ',feature ,body)))
          body))
    :documentation "Load the current feature after FEATURES."
    :indent 1)

  (setup-define :file-match
    (lambda (regexp)
      `(add-to-list 'auto-mode-alist (cons ,regexp ',(setup-get 'mode))))
    :documentation "Associate the current mode with files that match REGEXP."
    :debug '(form)
    :repeatable t)

  (setup-define :load-from
      (lambda (path)
        `(let ((path* (expand-file-name ,path)))
           (if (file-exists-p path*)
               (add-to-list 'load-path path*)
             ,(setup-quit))))
    :documentation "Add PATH to load path.
  This macro can be used as NAME, and it will replace itself with
  the nondirectory part of PATH.
  If PATH does not exist, abort the evaluation."
    :shorthand (lambda (args)
                 (intern
                  (file-name-nondirectory
                   (directory-file-name (cadr args))))))
#+end_src

** Leader key definition

#+begin_src emacs-lisp
  (setup-define :leader
    (lambda (&rest args)
      `(with-eval-after-load 'general
         (general-define-key ,@args
                             :states 'normal
                             :keymaps 'override
                             :prefix "SPC"
                             :global-prefix "C-SPC")))
    :documentation "Define a leader keybind"
    :debug '(form)
    :indent 0)

  (setup-define :local-leader
    (lambda (&rest args)
      `(with-eval-after-load 'general
         (let ((map ',(setup-get 'map)))
           (general-define-key ,@args
                               :states 'normal
                               :keymaps map
                               :prefix "SPC m"
                               :global-prefix "C-SPC m"))))
    :documentation "Define a local leader keybind"
    :debug '(form)
    :indent 0)
#+end_src

** Package definition

#+begin_src emacs-lisp
  (defun my/filter-straight-recipe (recipe)
      (let* ((plist (cdr recipe))
          (name (plist-get plist :straight)))
      (cons (if (and name (not (equal name t)))
        	  name
              (car recipe))
              (plist-put plist :straight nil))))

  (setup-define :pkg
      (lambda (&rest recipe)
      `(straight-use-package ',(my/filter-straight-recipe recipe)))
      :documentation "Install RECIPE via straight.el"
      :shorthand #'cadr)
#+end_src

** Ignore Buffers

#+begin_src emacs-lisp
  (setup-define :ignore-buffers
    (lambda (&rest buffers)
      `(setq ignored-buffers (append ignored-buffers ',buffers)))
    :documentation "Ignore buffers")
#+end_src

** Buffer configuration

#+begin_src emacs-lisp
  (setup-define :display-rule
    (lambda (condition &rest actions)
      `(add-to-list 'display-buffer-alist '(,condition . ,actions)))
    :documentation "Add to display buffer alist")
#+end_src

* Custom functions
** Open Music player

#+begin_src emacs-lisp
  (defun open-emms-window ()
    (persp-switch "music")
    (emms-smart-browse))
#+end_src

** Print terminal colors

#+begin_src emacs-lisp
  (defun print-colors ()
    (let ((colors '(black red green yellow blue magenta cyan white)))
      (mapc #'message
              (mapcar (lambda (color)
                        (format "%s = %s | %s\n"
                                color
                                (face-foreground (intern (format "ansi-color-%s" color)))
                                (face-foreground (intern (format "ansi-color-bright-%s" color)))))
                      colors))))
#+end_src

* Bindings
** Esc cancells all

#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Evil
*** Base

#+begin_src emacs-lisp
  (setup (:pkg undo-tree)
    (setq undo-tree-auto-save-history nil)
    (global-undo-tree-mode 1))

  (setup (:pkg evil)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    (setq evil-want-Y-yank-to-eol t)
    (setq evil-undo-system 'undo-tree)
    (setq evil-echo-state nil)
    (setq evil-auto-indent t)

    (defun my/elisp-lookup ()
      (interactive)
      (let ((sym (symbol-at-point)))
        (if sym
            (describe-symbol (symbol-at-point))
          (message "Invalid symbol"))))

    (evil-mode 1)

    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode))

    (:with-hook emacs-lisp-mode
      (:hook (setq evil-lookup-func #'my/elisp-lookup)))

    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src

*** Evil Collection

#+begin_src emacs-lisp
  (setup (:pkg evil-collection
               :host nil
               :type git
               :repo "git@github.com:toniz4/evil-collection.git")
    (:load-after evil
      (evil-collection-init)))
#+end_src

