init.org
*** Evil Goggles

#+begin_src emacs-lisp
  ;; (setup (:pkg evil-goggles)
  ;;   (:when-loaded
  ;;     (:option evil-goggles-enable-delete t
  ;;              evil-goggles-enable-change t
  ;;              evil-goggles--commands
  ;;              (append evil-goggles--commands
  ;;                      '((evil-magit-yank-whole-line
  ;;                         :face evil-goggles-yank-face
  ;;                         :switch evil-goggles-enable-yank
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (+evil:yank-unindented
  ;;                         :face evil-goggles-yank-face
  ;;                         :switch evil-goggles-enable-yank
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (+eval:region
  ;;                         :face evil-goggles-yank-face
  ;;                         :switch evil-goggles-enable-yank
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (lispyville-delete
  ;;                         :face evil-goggles-delete-face
  ;;                         :switch evil-goggles-enable-delete
  ;;                         :advice evil-goggles--generic-blocking-advice)
  ;;                        (lispyville-delete-line
  ;;                         :face evil-goggles-delete-face
  ;;                         :switch evil-goggles-enable-delete
  ;;                         :advice evil-goggles--delete-line-advice)
  ;;                        (lispyville-yank
  ;;                         :face evil-goggles-yank-face
  ;;                         :switch evil-goggles-enable-yank
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (lispyville-yank-line
  ;;                         :face evil-goggles-yank-face
  ;;                         :switch evil-goggles-enable-yank
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (lispyville-change
  ;;                         :face evil-goggles-change-face
  ;;                         :switch evil-goggles-enable-change
  ;;                         :advice evil-goggles--generic-blocking-advice)
  ;;                        (lispyville-change-line
  ;;                         :face evil-goggles-change-face
  ;;                         :switch evil-goggles-enable-change
  ;;                         :advice evil-goggles--generic-blocking-advice)
  ;;                        (lispyville-change-whole-line
  ;;                         :face evil-goggles-change-face
  ;;                         :switch evil-goggles-enable-change
  ;;                         :advice evil-goggles--generic-blocking-advice)
  ;;                        (lispyville-indent
  ;;                         :face evil-goggles-indent-face
  ;;                         :switch evil-goggles-enable-indent
  ;;                         :advice evil-goggles--generic-async-advice)
  ;;                        (lispyville-join
  ;;                         :face evil-goggles-join-face
  ;;                         :switch evil-goggles-enable-join
  ;;                         :advice evil-goggles--join-advice)))))
  ;;   (evil-goggles-mode)
  ;;   (evil-goggles-use-diff-faces))
#+end_src

*** Evil anzu

#+begin_src emacs-lisp
  (setup (:pkg evil-anzu)
    (:load-after evil
      (:option anzu-cons-mode-line-p nil)
      (global-anzu-mode 1)
      (require 'evil-anzu)))
#+end_src

** Which-key

#+begin_src emacs-lisp
  (setup (:pkg which-key)
    ;; (diminish 'which-key-mode)
    (which-key-mode)
    (setq which-key-idle-delay 0.3))
#+end_src

** General

#+begin_src emacs-lisp
  (use-package general
    :config
    (general-create-definer general-leader
      :states 'normal
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")
    (general-create-definer general-local-leader
      :states 'normal
      :prefix "SPC m"
      :global-prefix "C-SPC m"))

  (use-package emacs
    :general
    (general-leader
      "b" '(nil :which-key "Buffers")
      "br" '(revert-buffer :which-key "revert buffer")
      "bd" '(kill-current-buffer :which-key "kill current buffer")

      "f" '(nil :which-key "Files")
      "ff" '(find-file :which-key "Find file")

      "h" '(nil :which-key "Help")
      "hc" '(describe-char :which-key "Describe Char")
      "hC" '(describe-command :which-key "Describe Command")
      "he" '(view-echo-area-messages :which-key "Show Echo Area Messages")
      "hf" '(describe-function :which-key "Describe Function")
      "hF" '(describe-face :which-key "Describe Face")
      "hv" '(describe-variable :which-key "Describe Variable")
      "hk" '(describe-key :which-key "Describe Key")

      "o" '(nil :which-key "Apps")
      "p" '(nil :which-key "Project")
      "pf" '(project-find-file :which-key "Project find file")
      "qK" '(save-buffers-kill-emacs :which-key "Apps")))
#+end_src

** Surround

#+begin_src emacs-lisp
  (use-package evil-surround
    :init
    (global-evil-surround-mode))
#+end_src

* Misc Configuration
** Load Path

#+begin_src emacs-lisp
  (let ((default-directory (concat (file-name-directory user-init-file) "lisp")))
    (normal-top-level-add-subdirs-to-load-path))
#+end_src

** UI

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode '(10 . nil))
  (menu-bar-mode -1)
  (blink-cursor-mode 0)
  (set-default 'truncate-lines t)

#+end_src

** Diff Hl

#+begin_src emacs-lisp
  (use-package diff-hl
    :hook ((magit-pre-refresh . diff-hl-magit-pre-refresh)
           (magit-post-refresh . diff-hl-magit-post-refresh))
    :init
    (global-diff-hl-mode))
#+end_src

** General buffer configuration

#+begin_src emacs-lisp
  (setq help-window-select t)

  (setq display-buffer-alist
        '(("\\*\\([Hh]elp\\|Messages\\)\\*"
           (display-buffer-in-side-window)
           (window-height . 0.25)
           (side . bottom)
           (slot . 0)
           (window-parameters . ((mode-line-format . none))))))
#+end_src

** Scrolling

#+begin_src emacs-lisp
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
  (setq mouse-wheel-progressive-speed nil)
  (setq mouse-wheel-follow-mouse 't)
  (setq scroll-conservatively 1000)
  (setq scroll-margin 5)
  (setq use-dialog-box nil)
#+end_src

** Diminish

#+begin_src emacs-lisp
  (use-package diminish)
#+end_src

** Line Numbers

#+begin_src emacs-lisp
  (column-number-mode)

  (setq display-line-numbers-type 'relative)
  (setq display-line-numbers-width-start t)
  (setq display-line-numbers-grow-only t)

  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode #'display-line-numbers-mode))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Misc

#+begin_src emacs-lisp
  (setq large-file-warning-threshold nil)
  (setq vc-follow-symlinks t)
  (setq ad-redefinition-action 'accept)
  ;; annoying ass sound
  (setq ring-bell-function 'ignore)
  (defalias 'yes-or-no-p 'y-or-n-p)
  (setq frame-resize-pixelwise 't)
  (save-place-mode)
#+end_src

** Pulsar

#+begin_src emacs-lisp
  (use-package pulsar
    :hook ((minibuffer-setup . pulsar-pulse-line)
           (consult-after-jump . pulsar-recenter-top)
           (consult-after-jump . pulsar-reveal-entry))
    :config
    (setq pulsar-pulse-functions (append pulsar-pulse-functions
                                            '(evil-goto-line
                                              evil-goto-first-line
                                              evil-scroll-down
                                              evil-scroll-up
                                              evil-window-down
                                              evil-window-up
                                              evil-window-left
                                              evil-window-right
                                              evil-window-next
                                              evil-jump-backward
                                              evil-jump-forward)))
    :init
    (pulsar-global-mode))
#+end_src

** Rainbow mode

#+begin_src emacs-lisp
  (use-package rainbow-mode
    :hook (css-mode . rainbow-mode)
    :general
    (general-leader
     "o R" 'rainbow-mode))
#+end_src

