init.org
** Org Agenda

#+begin_src emacs-lisp
  (defvar nextcloud-password)
  (defvar nextcloud-user)
  (defvar nextcloud-remote-path)
  (defvar nextcloud-local-path)
  (defvar nextcloud-url)

  (defun sync-nextcloud ()
    (interactive)
    (let ((command (format "nextcloudcmd --password '%s' --user '%s' --path '%s' '%s' '%s'"
                           nextcloud-password
                           nextcloud-user
                           nextcloud-remote-path
                           nextcloud-local-path
                           nextcloud-url)))
      (save-window-excursion
        (shell-command command))
      (message "sync done")
      (revert-buffer :ignore-auto :noconfirm)))

  (setq org-agenda-files '("~/doc/agendas/agenda.org"))
#+end_src

** Hooks

#+begin_src emacs-lisp
  (defvar after-enable-theme-hook nil
    "Normal hook run after enabling a theme.")

  (defun run-after-enable-theme-hook (&rest _args)
    "Run `after-enable-theme-hook'."
    (run-hooks 'after-enable-theme-hook))

  (advice-add 'enable-theme :after #'run-after-enable-theme-hook)
#+end_src

* Paths

#+begin_src emacs-lisp
  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering
    :init
    (require 'no-littering))

  ;; Keep customization settings in a temporary file (thanks Ambrevar!)
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)

  ; Backup directory
  (setq backup-directory-alist `((".*" . ,(expand-file-name "backups" user-emacs-directory)))
        auto-save-file-name-transforms `((".*" ,(expand-file-name "backups" user-emacs-directory) t))
        create-lockfiles nil
        backup-by-copying t
        version-control t
        delete-old-versions t
        vc-make-backup-files t
        kept-old-versions 10
        kept-new-versions 10)
#+end_src

* Theme
** Fonts

#+begin_src emacs-lisp
  (use-package fontaine
    :custom
    (fontaine-latest-state-file (locate-user-emacs-file "fontaine-latest-state.eld"))
    (fontaine-presets '((regular :default-height 170)
                        (big :default-height 200)
                        (t :default-family "Go Mono Nerd Font")))
    :config
    (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))
    :init
    (fontaine-mode))
#+end_src

** Colorscheme

#+begin_src emacs-lisp
  (use-package modus-themes
    :custom
    (modus-themes-italic-constructs t)
    (modus-themes-org-blocks 'gray-background)
    :config
    (setq modus-themes-common-palette-overrides modus-themes-preset-overrides-intense)
    (modus-themes-select 'modus-vivendi))
#+end_src

** Pretify symbols

#+begin_src emacs-lisp
  (global-prettify-symbols-mode)
#+end_src

* Org

#+begin_src emacs-lisp
  (use-package org
    :general
    (general-local-leader
     :keymaps 'org-mode-map
     "t" '(org-todo  :which-key "Mark todo")
     "T" '(org-todo-list  :which-key "Todo List")
     "x" '(org-toggle-checkbox :which-key "Toggle Checkbox")
     "d" '(nil :which-key "Dates")
     "dd" '(org-deadline :which-key "org-deadline")
     "ds" '(org-schedule :which-key "org-schedule")
     "dt" '(org-time-stamp :which-key "org-timestamp")
     "dT" '(org-time-stamp-inactive :which-key "org-timestamp"))
    :custom
    (org-ellipsis " ▾")
    (org-hide-emphasis-markers t)
    (org-src-fontify-natively t)
    (org-fontify-quote-and-verse-blocks t)
    (org-src-tab-acts-natively t)
    (org-edit-src-content-indentation 2)
    (org-hide-block-startup nil)
    (org-src-preserve-indentation nil)
    (org-startup-folded 'content)
    (org-cycle-separator-lines 2)
    (org-capture-bookmark nil)
    :hook (org-mode . my-org-mode-setup)
    :init
    (defun my-org-mode-setup ()
      (org-indent-mode)
      (auto-fill-mode 0)
      (visual-line-mode 1))
    :config
    (require 'org-tempo)
    ;; (require 'ox-latex)

    (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
    (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("json" . "src json")))
#+end_src

** Tangle

#+begin_src emacs-lisp
  (defun my/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/init.org"))
      (let ((org-config-babel-evaluate nil))
        (org-babel-tangle))))

    (add-hook 'org-mode-hook
              (lambda ()
                (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
#+end_src

* Modeline
** Minions

#+begin_src emacs-lisp
  (use-package minions
    :init
    (minions-mode))
#+end_src

** Base Config

#+begin_src emacs-lisp
  (use-package my-modeline
    :straight nil
    :config
    (setq-default mode-line-format my-modeline-format))
#+end_src

* Workspaces

#+begin_src emacs-lisp
  (use-package persp-mode
    :hook
    (window-setup . persp-mode)
    :general
    (general-leader
     "bD" '(persp-kill-buffer :which-key "Kill buffer")
     "TAB" '(:ignore t :which-key "Perspective")
     "TAB n" '(persp-switch :which-key "Switch perspective")
     "TAB k" '(persp-kill :which-key "Kill perspective")
     "TAB l" '(persp-next :which-key "Next perspective")
     "TAB h" '(persp-prev :which-key "Previous perspective")

     "TAB 1" (lambda () (interactive) (my-persp-switch-by-index 0))
     "TAB 2" (lambda () (interactive) (my-persp-switch-by-index 1))
     "TAB 3" (lambda () (interactive) (my-persp-switch-by-index 2))
     "TAB 4" (lambda () (interactive) (my-persp-switch-by-index 3))
     "TAB 5" (lambda () (interactive) (my-persp-switch-by-index 4))
     "TAB 6" (lambda () (interactive) (my-persp-switch-by-index 5))
     "TAB 7" (lambda () (interactive) (my-persp-switch-by-index 6))
     "TAB 8" (lambda () (interactive) (my-persp-switch-by-index 7))
     "TAB 9" (lambda () (interactive) (my-persp-switch-by-index 8))
     "TAB 0" (lambda () (interactive) (my-persp-switch-by-index nil)))
    :custom
    (persp-autokill-buffer-on-remove 'kill-weak)
    (persp-auto-resume-time 0.1)
    (add-to-list 'persp-save-buffer-functions #'my-persp-ignore-none-persp)
    :init
    (defun my-persp-switch-by-index (index)
      "Switch to perspective by index, if the index is larger than the last perspecive or nil, switch to last perspective"
      (let* ((persps (reverse (butlast (persp-persps))))
             (selected (if index
                           (nth index persps)
                         (car (last persps)))))
        (if selected
            (persp-switch (safe-persp-name selected))
          (persp-switch (safe-persp-name (car (last persps)))))))

    (defun my-persp-ignore-none-persp (buffer)
      (when (not (persp--buffer-in-persps buffer))
        'skip)))
#+end_src

* Auto Revert

#+begin_src emacs-lisp
  (setq global-auto-revert-non-file-buffers t)
#+end_src

* Parens
** Show Paren Mode

#+begin_src emacs-lisp
  (use-package emacs
    :init
    (show-paren-mode))
#+end_src

** Indentation

#+begin_src emacs-lisp
  (use-package aggressive-indent)

  (add-hook 'prog-mode-hook #'electric-indent-mode)
#+end_src

* TRAMP

#+begin_src emacs-lisp
  (setq tramp-default-method "ssh")
#+end_src

* Text Editing
** Identation

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

** Comments

#+begin_src emacs-lisp
  (use-package evil-commentary
    :init
    (evil-commentary-mode))
#+end_src

** White Space

#+begin_src emacs-lisp
  (setq-default show-trailing-whitespace t)
#+end_src

