init.org
** Smartparens

#+begin_src emacs-lisp
  (use-package smartparens
    :custom (sp-highlight-pair-overlay nil)
    :hook ((prog-mode text-mode) . smartparens-mode)
    :init
    (defun indent-between-pair (&rest _ignored)
      (newline)
      (indent-according-to-mode)
      (forward-line -1)
      (indent-according-to-mode))
    :config
    (require 'smartparens-config)
    (sp-local-pair 'prog-mode "{" nil :post-handlers '((indent-between-pair "RET")))
    (sp-local-pair 'prog-mode "[" nil :post-handlers '((indent-between-pair "RET")))
    (sp-local-pair 'prog-mode "(" nil :post-handlers '((indent-between-pair "RET"))))
#+end_src

** Cleverparens

#+begin_src emacs-lisp
  (use-package evil-cleverparens
    :hook ((lisp-mode
            emacs-lisp-mode
            ielm-mode
            scheme-mode
            racket-mode
            hy-mode
            lfe-mode
            dune-mode
            clojure-mode
            fennel-mode)
           . evil-cleverparens-mode))
#+end_src

** Code Folding

#+begin_src emacs-lisp
  (use-package origami
    :hook (yaml-mode . origami-mode))
#+end_src

* Env

#+begin_src emacs-lisp
  (use-package envrc
    :init
    (envrc-global-mode))
#+end_src

* Completion Systems
** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :init
    (marginalia-mode))
#+end_src

** Save History

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (history-length 25)
    :init
    (savehist-mode 1))
#+end_src

** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :preface
    (defun my-minibuffer-backward-kill (arg)
      "When minibuffer is completing a file name delete up to parent
  folder, otherwise delete a word"
      (interactive "p")
      (if minibuffer-completing-file-name
          (if (string-match-p "/." (minibuffer-contents))
              (zap-up-to-char (- arg) ?/)
            (delete-minibuffer-contents))
        (kill-word (- arg))))
    :hook
    (minibuffer-setup . cursor-intangible-mode)
    :general
    (:keymaps 'vertico-map
              "C-j" 'vertico-next
              "C-k" 'vertico-previous
              "C-f" 'vertico-exit)
    (:keymaps 'minibuffer-local-map
              "C-<backspace>" 'my-minibuffer-backward-kill)
    :custom
    (minibuffer-prompt-properties '(read-only t cursor-intangible t face minibuffer-prompt))
    (vertico-cycle t)
    :init
    (vertico-mode))
#+end_src

** Corfu

#+begin_src emacs-lisp
  (use-package corfu
    :preface
    (defun corfu-enable-in-minibuffer ()
      "Enable Corfu in the minibuffer if `completion-at-point' is bound."
      (when (where-is-internal #'completion-at-point (list (current-local-map)))
        (corfu-mode 1)))
    :hook (((prog-mode eshell-mode) . corfu-mode)
           (corfu-mode . corfu-popupinfo-mode)
           (minibuffer-setup . corfu-enable-in-minibuffer))
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-popupinfo-delay '(1.0 . 0.5))
    (corfu-auto-delay 0)
    (corfu-auto-prefix 2)
    (corfu-quit-no-match nil)
    (corfu-preselect 'prompt)
    :general
    (:keymaps 'corfu-map
              "C-s" 'corfu-quit
              "<tab>" 'corfu-next
              "<backtab>" 'corfu-previous))
#+end_src

** Cape
#+begin_src emacs-lisp
  (use-package cape
    :init
    (add-to-list 'completion-at-point-functions #'cape-file))
#+end_src

** Orderless

#+begin_src emacs-lisp
  (use-package orderless
    :custom
    (orderless-matching-styles '(orderless-literal orderless-flex orderless-regexp))
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    :after persp-mode
    :init
    (with-eval-after-load 'consult
      (defun my/switch-buffer ()
        (interactive)
        (with-persp-buffer-list
         nil
         (let ((consult-buffer-filter (append consult-buffer-filter ignored-buffers)))
           (consult-buffer)))))
    :general
    (:keymaps 'minibuffer-local-map
              "C-r" 'consult-history)
    (general-leader
      "SPC" '(my/switch-buffer :which-key "Buffers")
      "/" '(consult-ripgrep :which-key "Ripgrep")
      "bB" '(consult-buffer :which-key "All Buffers")))
#+end_src

* Languages

** Common Lisp

#+begin_src emacs-lisp
  (use-package sly)
#+end_src

** Clojure
#+begin_src emacs-lisp
  (use-package cider
    :hook (clojure-mode . cider-mode)
    :custom
    ;; (cider-clojure-cli-global-options "-Adev")
    (cider-repl-display-help-banner nil)
    (cider-eval-result-duration 'change)
    (cider-repl-pop-to-buffer-on-connect 'display-only)
    (cider-xref-fn-depth 90)
    (cider-offer-to-open-cljs-app-in-browser nil)
    :general
    (general-local-leader
      :keymaps 'clojure-mode-map
      "e" '(nil :which-key "Eval")
      "eb" '(cider-eval-buffer :which-key "Eval buffer")
      "ed" '(cider-debug-defun-at-point :which-key "Eval debug")
      "'" '(cider-connect-clj :which-key "Connect clj")
      "\"" '(cider-connect-cljs :which-key "Connect cljs")
      "j" '(cider-jack-in-clj :which-key "Jack-in clj")
      "J" '(cider-jack-in-cljs :which-key "Jack-in cljs")))
#+end_src

** Nix

#+begin_src emacs-lisp
  (use-package nix-mode)
#+end_src

** Lua

#+begin_src emacs-lisp
  (use-package lua-mode)
#+end_src

** Haskell

#+begin_src emacs-lisp
  (use-package haskell-mode)
#+end_src

** Scala

#+begin_src emacs-lisp
  (use-package scala-mode)
#+end_src

** Go

#+begin_src emacs-lisp
  (use-package go-mode)
#+end_src

** Typescript

#+begin_src emacs-lisp
  (use-package typescript-mode
    :custom
    (typescript-indent-level 2))
#+end_src

** Yaml

#+begin_src emacs-lisp
  (use-package yaml-mode)
#+end_src
* Programs
** EMMS

#+begin_src emacs-lisp
  (use-package emms
    :custom
    (emms-player-list '(emms-player-mpd))
    (emms-info-functions '(emms-info-mpd))
    (emms-source-file-default-directory "/mnt/extern/music")
    (emms-player-mpd-music-directory emms-source-file-default-directory)
    (emms-browser-covers #'emms-browser-cache-thumbnail-async)
    :config
    (require 'emms-setup)
    (require 'emms-player-mpd)
    (emms-all))
#+end_src

** Magit

#+begin_src emacs-lisp
  (use-package magit
    :hook (git-commit-mode . evil-insert-state)
    :custom
    (magit-display-buffer-function #'my-magit-buffer-function)
    (transient-display-buffer-action '(display-buffer-below-selected))
    :general
    (general-leader
      "g" '(:ignore t :which-key "Git")
      "gg" '(magit :which-key "Magit"))
    :config
    (defun my-magit-buffer-function (buffer)
      (let ((buffer-mode (buffer-local-value 'major-mode buffer)))
        (display-buffer
         buffer (cond
                 ((and (eq buffer-mode 'magit-status-mode)
                       (get-buffer-window buffer))
                  '(display-buffer-reuse-window))
                 ;; Any magit buffers opened from a commit window should open below
                 ;; it. Also open magit process windows below.
                 ((or (bound-and-true-p git-commit-mode)
                      (eq buffer-mode 'magit-process-mode))
                  (let ((size (if (eq buffer-mode 'magit-process-mode)
                                  0.35
                                0.7)))
                    `(display-buffer-below-selected
                      . ((window-height . ,(truncate (* (window-height) size)))))))

                 ;; Everything else should reuse the current window.
                 ((or (not (derived-mode-p 'magit-mode))
                      (not (memq (with-current-buffer buffer major-mode)
                                 '(magit-process-mode
                                   magit-revision-mode
                                   magit-diff-mode
                                   magit-stash-mode
                                   magit-status-mode))))
                  '(display-buffer-same-window))
                 nil)))))
#+end_src

** Restclient

#+begin_src emacs-lisp
  (use-package restclient
    :general
    (general-leader
      "o r" '(restclient-buffer :which-key "Open restclient buffer"))
    :init
    (defun restclient-buffer ()
      (interactive)
      (switch-to-buffer "restclient.http")
      (restclient-mode)))
#+end_src

* LSP
