init.org
** Eglot

#+begin_src emacs-lisp
  (use-package eglot
    :hook (((clojure-mode
             clojurescript-mode
             go-mode
             c-mode)
            .
            eglot-ensure)
           (eglot-managed-mode . my-eglot-lower-capf-prio))
    :custom
    (eglot-confirm-server-initiated-edits nil)
    (max-mini-window-height 2)
    :general
    (general-local-leader
      :keymaps 'eglot-mode-map
      "c" '(nil :which-key "Eglot")
      "cc" '(eglot-code-actions :which-key "Code Actions")
      "cr" '(eglot-rename :which-key "Rename"))
    :init
    (defun my-eglot-lower-capf-prio ()
      "Make the eglot capf have lower priority"
      (when (boundp 'cider-mode)
        (when cider-mode
          (remove-from-list completion-at-point-functions t)
          (remove-from-list completion-at-point-functions #'eglot-completion-at-point)
          (add-to-list 'completion-at-point-functions #'eglot-completion-at-point t)
          (add-to-list 'completion-at-point-functions t t)))))
#+end_src

** Sideline

#+begin_src emacs-lisp
  (use-package sideline-flymake
    :custom
    (sideline-flymake-display-mode 'line))

  (use-package sideline
    :hook (flymake-mode . sideline-mode)
    :custom
    (sideline-backends-right '(sideline-flymake)))
#+end_src

** YasNippets

#+begin_src emacs-lisp
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode))
#+end_src

* Eshell

#+begin_src emacs-lisp
  (use-package my-eshell-toggle
    :straight nil
    :general
    (general-leader
      "o o" '(my-eshell-toggle :which-key "Toggle eshell")))
#+end_src

* Utils
** jarchive

#+begin_src emacs-lisp
  (use-package jarchive
    :init
    (jarchive-setup))
#+end_src
